<script setup lang="ts">
import M3Window from '../m3/Window/M3Window.vue'
import M3Scrollbar from '../m3/Scrollbar/M3Scrollbar.vue'
</script>

<template>
  <div>
    <m3-window>
      <template v-slot:control="bind">
        <button v-bind="bind">control 1</button>
      </template>
    </m3-window>
    <m3-scrollbar border style="max-height: 320px">
      <p>
        Шесть лет (1811—1817) Пушкин провёл в Императорском Царскосельском лицее, открытом 19 октября 1811 года. Здесь
        юный поэт пережил события Отечественной войны 1812 года. Здесь впервые открылся и был высоко оценён его
        поэтический дар. Воспоминания о годах, проведённых в Лицее, о лицейском братстве навсегда остались в душе
        поэта[16].
      </p>
      <p>
        Среди лицейских преподавателей Пушкина был профессор нравственных и политических наук А. П. Куницын, учившийся в
        Гетингенском университете и бывший близким со многими будущими декабристами[17]. Пушкин на всю жизнь сохранил
        признательность Куницыну. Он — единственный из лицейских учителей, к которому Пушкин неоднократно обращался в
        стихах[18].
      </p>
      <p>
        В лицейский период Пушкин написал много стихотворных произведений. Его вдохновляли французские поэты XVII—XVIII
        веков, с творчеством которых он познакомился в детстве, читая книги из библиотеки отца. Любимые поэты и писатели
        молодого Пушкина перечислены в стихотворении «Городок» (1815 г.): Вольтер, Гомер, Вергилий, Т. Тассо, Лафонтен,
        Дмитриев, Крылов, Державин, Вержье, Грекур, Парни, Расин, Мольер, Фонвизин, Княжнин, Озеров, Руссо, Карамзин,
        Лагарп[19]. В его ранней лирике соединились традиции французского и русского классицизма. Учителями
        Пушкина-поэта стали Батюшков, признанный мастер «лёгкой поэзии», и Жуковский, глава отечественного романтизма.
        Пушкинская лирика периода 1813—1815 годов пронизана мотивами быстротечности жизни, которая диктовала жажду
        наслаждения радостями бытия. С 1816 года, вслед за Жуковским, он обращается к элегиям, где развивает характерные
        для этого жанра мотивы: неразделённой любви, ухода молодости, угасания души. Лирика Пушкина ещё подражательна,
        полна литературных условностей и штампов, тем не менее уже тогда начинающий поэт выбирает свой, особый путь[20].
        Не замыкаясь на поэзии камерной, Пушкин обращался к темам более сложным, общественно значимым. «Воспоминания в
        Царском Селе» (1814), заслужившие одобрение Державина, — в начале 1815 года Пушкин читал стихотворение в его
        присутствии, — посвящено событиям Отечественной войны 1812 года[21]. Стихотворение было опубликовано в 1815 году
        в журнале «Российский музеум» за полной подписью автора. А в пушкинском послании «Лицинию» критически изображена
        современная жизнь России, где в образе «любимца деспота» выведен Аракчеев. Уже в начале своего творческого пути
        Пушкин проявлял интерес к русским писателям-сатирикам прошлого века. Влияние Фонвизина чувствуется в
        сатирической поэме Пушкина «Тень Фонвизина» (1815)[22]; с творчеством Радищева связаны «Бова» (1814) и
        «Безверие» (1817)[23].
      </p>
      <p>
        В июле 1814 года Пушкин впервые выступил в печати в издававшемся в Москве журнале «Вестник Европы». В
        тринадцатом номере было напечатано стихотворение «К другу-стихотворцу», подписанное псевдонимом Александр
        Н.к.ш.п. и обращённое к Кюхельбекеру[~ 5][13]:60[24].
      </p>
      <p>
        Ещё воспитанником Лицея, Пушкин вошёл в литературное общество «Арзамас»[25], выступавшее против рутины и архаики
        в литературном деле, и принял действенное участие в полемике с объединением «Беседа любителей русского слова»,
        отстаивавшим каноны классицизма прошлого века. Привлечённый творчеством наиболее ярких представителей нового
        литературного направления, Пушкин испытывал в то время сильное влияние поэзии Батюшкова, Жуковского,
        Давыдова[26]. Последний поначалу импонировал Пушкину темой бравого вояки, а после тем, что сам поэт называл
        «кручением стиха» — резкими сменами настроения, экспрессией, неожиданным соединением образов. Позднее Пушкин
        говорил, что подражая в молодости Давыдову, «усвоил себе его манеру навсегда»[27]. Многие лицейские
        стихотворения Пушкина навеяны лирикой Дениса Давыдова: «Пирующие студенты», «Казак», «Наездники», «Усы»,
        «Воспоминание».
      </p>
    </m3-scrollbar>
    <div style="height: 24px;" />
    <m3-scrollbar border inverse style="max-height: 320px">
      <p>
        Шесть лет (1811—1817) Пушкин провёл в Императорском Царскосельском лицее, открытом 19 октября 1811 года. Здесь
        юный поэт пережил события Отечественной войны 1812 года. Здесь впервые открылся и был высоко оценён его
        поэтический дар. Воспоминания о годах, проведённых в Лицее, о лицейском братстве навсегда остались в душе
        поэта[16].
      </p>
      <p>
        Среди лицейских преподавателей Пушкина был профессор нравственных и политических наук А. П. Куницын, учившийся в
        Гетингенском университете и бывший близким со многими будущими декабристами[17]. Пушкин на всю жизнь сохранил
        признательность Куницыну. Он — единственный из лицейских учителей, к которому Пушкин неоднократно обращался в
        стихах[18].
      </p>
      <p>
        В лицейский период Пушкин написал много стихотворных произведений. Его вдохновляли французские поэты XVII—XVIII
        веков, с творчеством которых он познакомился в детстве, читая книги из библиотеки отца. Любимые поэты и писатели
        молодого Пушкина перечислены в стихотворении «Городок» (1815 г.): Вольтер, Гомер, Вергилий, Т. Тассо, Лафонтен,
        Дмитриев, Крылов, Державин, Вержье, Грекур, Парни, Расин, Мольер, Фонвизин, Княжнин, Озеров, Руссо, Карамзин,
        Лагарп[19]. В его ранней лирике соединились традиции французского и русского классицизма. Учителями
        Пушкина-поэта стали Батюшков, признанный мастер «лёгкой поэзии», и Жуковский, глава отечественного романтизма.
        Пушкинская лирика периода 1813—1815 годов пронизана мотивами быстротечности жизни, которая диктовала жажду
        наслаждения радостями бытия. С 1816 года, вслед за Жуковским, он обращается к элегиям, где развивает характерные
        для этого жанра мотивы: неразделённой любви, ухода молодости, угасания души. Лирика Пушкина ещё подражательна,
        полна литературных условностей и штампов, тем не менее уже тогда начинающий поэт выбирает свой, особый путь[20].
        Не замыкаясь на поэзии камерной, Пушкин обращался к темам более сложным, общественно значимым. «Воспоминания в
        Царском Селе» (1814), заслужившие одобрение Державина, — в начале 1815 года Пушкин читал стихотворение в его
        присутствии, — посвящено событиям Отечественной войны 1812 года[21]. Стихотворение было опубликовано в 1815 году
        в журнале «Российский музеум» за полной подписью автора. А в пушкинском послании «Лицинию» критически изображена
        современная жизнь России, где в образе «любимца деспота» выведен Аракчеев. Уже в начале своего творческого пути
        Пушкин проявлял интерес к русским писателям-сатирикам прошлого века. Влияние Фонвизина чувствуется в
        сатирической поэме Пушкина «Тень Фонвизина» (1815)[22]; с творчеством Радищева связаны «Бова» (1814) и
        «Безверие» (1817)[23].
      </p>
      <p>
        В июле 1814 года Пушкин впервые выступил в печати в издававшемся в Москве журнале «Вестник Европы». В
        тринадцатом номере было напечатано стихотворение «К другу-стихотворцу», подписанное псевдонимом Александр
        Н.к.ш.п. и обращённое к Кюхельбекеру[~ 5][13]:60[24].
      </p>
      <p>
        Ещё воспитанником Лицея, Пушкин вошёл в литературное общество «Арзамас»[25], выступавшее против рутины и архаики
        в литературном деле, и принял действенное участие в полемике с объединением «Беседа любителей русского слова»,
        отстаивавшим каноны классицизма прошлого века. Привлечённый творчеством наиболее ярких представителей нового
        литературного направления, Пушкин испытывал в то время сильное влияние поэзии Батюшкова, Жуковского,
        Давыдова[26]. Последний поначалу импонировал Пушкину темой бравого вояки, а после тем, что сам поэт называл
        «кручением стиха» — резкими сменами настроения, экспрессией, неожиданным соединением образов. Позднее Пушкин
        говорил, что подражая в молодости Давыдову, «усвоил себе его манеру навсегда»[27]. Многие лицейские
        стихотворения Пушкина навеяны лирикой Дениса Давыдова: «Пирующие студенты», «Казак», «Наездники», «Усы»,
        «Воспоминание».
      </p>
    </m3-scrollbar>
    <p>
      Шесть лет (1811—1817) Пушкин провёл в Императорском Царскосельском лицее, открытом 19 октября 1811 года. Здесь
      юный поэт пережил события Отечественной войны 1812 года. Здесь впервые открылся и был высоко оценён его
      поэтический дар. Воспоминания о годах, проведённых в Лицее, о лицейском братстве навсегда остались в душе
      поэта[16].
    </p>
    <p>
      Среди лицейских преподавателей Пушкина был профессор нравственных и политических наук А. П. Куницын, учившийся в
      Гетингенском университете и бывший близким со многими будущими декабристами[17]. Пушкин на всю жизнь сохранил
      признательность Куницыну. Он — единственный из лицейских учителей, к которому Пушкин неоднократно обращался в
      стихах[18].
    </p>
    <p>
      В лицейский период Пушкин написал много стихотворных произведений. Его вдохновляли французские поэты XVII—XVIII
      веков, с творчеством которых он познакомился в детстве, читая книги из библиотеки отца. Любимые поэты и писатели
      молодого Пушкина перечислены в стихотворении «Городок» (1815 г.): Вольтер, Гомер, Вергилий, Т. Тассо, Лафонтен,
      Дмитриев, Крылов, Державин, Вержье, Грекур, Парни, Расин, Мольер, Фонвизин, Княжнин, Озеров, Руссо, Карамзин,
      Лагарп[19]. В его ранней лирике соединились традиции французского и русского классицизма. Учителями
      Пушкина-поэта стали Батюшков, признанный мастер «лёгкой поэзии», и Жуковский, глава отечественного романтизма.
      Пушкинская лирика периода 1813—1815 годов пронизана мотивами быстротечности жизни, которая диктовала жажду
      наслаждения радостями бытия. С 1816 года, вслед за Жуковским, он обращается к элегиям, где развивает характерные
      для этого жанра мотивы: неразделённой любви, ухода молодости, угасания души. Лирика Пушкина ещё подражательна,
      полна литературных условностей и штампов, тем не менее уже тогда начинающий поэт выбирает свой, особый путь[20].
      Не замыкаясь на поэзии камерной, Пушкин обращался к темам более сложным, общественно значимым. «Воспоминания в
      Царском Селе» (1814), заслужившие одобрение Державина, — в начале 1815 года Пушкин читал стихотворение в его
      присутствии, — посвящено событиям Отечественной войны 1812 года[21]. Стихотворение было опубликовано в 1815 году
      в журнале «Российский музеум» за полной подписью автора. А в пушкинском послании «Лицинию» критически изображена
      современная жизнь России, где в образе «любимца деспота» выведен Аракчеев. Уже в начале своего творческого пути
      Пушкин проявлял интерес к русским писателям-сатирикам прошлого века. Влияние Фонвизина чувствуется в
      сатирической поэме Пушкина «Тень Фонвизина» (1815)[22]; с творчеством Радищева связаны «Бова» (1814) и
      «Безверие» (1817)[23].
    </p>
    <p>
      В июле 1814 года Пушкин впервые выступил в печати в издававшемся в Москве журнале «Вестник Европы». В
      тринадцатом номере было напечатано стихотворение «К другу-стихотворцу», подписанное псевдонимом Александр
      Н.к.ш.п. и обращённое к Кюхельбекеру[~ 5][13]:60[24].
    </p>
    <p>
      Ещё воспитанником Лицея, Пушкин вошёл в литературное общество «Арзамас»[25], выступавшее против рутины и архаики
      в литературном деле, и принял действенное участие в полемике с объединением «Беседа любителей русского слова»,
      отстаивавшим каноны классицизма прошлого века. Привлечённый творчеством наиболее ярких представителей нового
      литературного направления, Пушкин испытывал в то время сильное влияние поэзии Батюшкова, Жуковского,
      Давыдова[26]. Последний поначалу импонировал Пушкину темой бравого вояки, а после тем, что сам поэт называл
      «кручением стиха» — резкими сменами настроения, экспрессией, неожиданным соединением образов. Позднее Пушкин
      говорил, что подражая в молодости Давыдову, «усвоил себе его манеру навсегда»[27]. Многие лицейские
      стихотворения Пушкина навеяны лирикой Дениса Давыдова: «Пирующие студенты», «Казак», «Наездники», «Усы»,
      «Воспоминание».
    </p>
    <p>
      Шесть лет (1811—1817) Пушкин провёл в Императорском Царскосельском лицее, открытом 19 октября 1811 года. Здесь
      юный поэт пережил события Отечественной войны 1812 года. Здесь впервые открылся и был высоко оценён его
      поэтический дар. Воспоминания о годах, проведённых в Лицее, о лицейском братстве навсегда остались в душе
      поэта[16].
    </p>
    <p>
      Среди лицейских преподавателей Пушкина был профессор нравственных и политических наук А. П. Куницын, учившийся в
      Гетингенском университете и бывший близким со многими будущими декабристами[17]. Пушкин на всю жизнь сохранил
      признательность Куницыну. Он — единственный из лицейских учителей, к которому Пушкин неоднократно обращался в
      стихах[18].
    </p>
    <p>
      В лицейский период Пушкин написал много стихотворных произведений. Его вдохновляли французские поэты XVII—XVIII
      веков, с творчеством которых он познакомился в детстве, читая книги из библиотеки отца. Любимые поэты и писатели
      молодого Пушкина перечислены в стихотворении «Городок» (1815 г.): Вольтер, Гомер, Вергилий, Т. Тассо, Лафонтен,
      Дмитриев, Крылов, Державин, Вержье, Грекур, Парни, Расин, Мольер, Фонвизин, Княжнин, Озеров, Руссо, Карамзин,
      Лагарп[19]. В его ранней лирике соединились традиции французского и русского классицизма. Учителями
      Пушкина-поэта стали Батюшков, признанный мастер «лёгкой поэзии», и Жуковский, глава отечественного романтизма.
      Пушкинская лирика периода 1813—1815 годов пронизана мотивами быстротечности жизни, которая диктовала жажду
      наслаждения радостями бытия. С 1816 года, вслед за Жуковским, он обращается к элегиям, где развивает характерные
      для этого жанра мотивы: неразделённой любви, ухода молодости, угасания души. Лирика Пушкина ещё подражательна,
      полна литературных условностей и штампов, тем не менее уже тогда начинающий поэт выбирает свой, особый путь[20].
      Не замыкаясь на поэзии камерной, Пушкин обращался к темам более сложным, общественно значимым. «Воспоминания в
      Царском Селе» (1814), заслужившие одобрение Державина, — в начале 1815 года Пушкин читал стихотворение в его
      присутствии, — посвящено событиям Отечественной войны 1812 года[21]. Стихотворение было опубликовано в 1815 году
      в журнале «Российский музеум» за полной подписью автора. А в пушкинском послании «Лицинию» критически изображена
      современная жизнь России, где в образе «любимца деспота» выведен Аракчеев. Уже в начале своего творческого пути
      Пушкин проявлял интерес к русским писателям-сатирикам прошлого века. Влияние Фонвизина чувствуется в
      сатирической поэме Пушкина «Тень Фонвизина» (1815)[22]; с творчеством Радищева связаны «Бова» (1814) и
      «Безверие» (1817)[23].
    </p>
    <p>
      В июле 1814 года Пушкин впервые выступил в печати в издававшемся в Москве журнале «Вестник Европы». В
      тринадцатом номере было напечатано стихотворение «К другу-стихотворцу», подписанное псевдонимом Александр
      Н.к.ш.п. и обращённое к Кюхельбекеру[~ 5][13]:60[24].
    </p>
    <p>
      Ещё воспитанником Лицея, Пушкин вошёл в литературное общество «Арзамас»[25], выступавшее против рутины и архаики
      в литературном деле, и принял действенное участие в полемике с объединением «Беседа любителей русского слова»,
      отстаивавшим каноны классицизма прошлого века. Привлечённый творчеством наиболее ярких представителей нового
      литературного направления, Пушкин испытывал в то время сильное влияние поэзии Батюшкова, Жуковского,
      Давыдова[26]. Последний поначалу импонировал Пушкину темой бравого вояки, а после тем, что сам поэт называл
      «кручением стиха» — резкими сменами настроения, экспрессией, неожиданным соединением образов. Позднее Пушкин
      говорил, что подражая в молодости Давыдову, «усвоил себе его манеру навсегда»[27]. Многие лицейские
      стихотворения Пушкина навеяны лирикой Дениса Давыдова: «Пирующие студенты», «Казак», «Наездники», «Усы»,
      «Воспоминание».
    </p>
    <p>
      Шесть лет (1811—1817) Пушкин провёл в Императорском Царскосельском лицее, открытом 19 октября 1811 года. Здесь
      юный поэт пережил события Отечественной войны 1812 года. Здесь впервые открылся и был высоко оценён его
      поэтический дар. Воспоминания о годах, проведённых в Лицее, о лицейском братстве навсегда остались в душе
      поэта[16].
    </p>
    <p>
      Среди лицейских преподавателей Пушкина был профессор нравственных и политических наук А. П. Куницын, учившийся в
      Гетингенском университете и бывший близким со многими будущими декабристами[17]. Пушкин на всю жизнь сохранил
      признательность Куницыну. Он — единственный из лицейских учителей, к которому Пушкин неоднократно обращался в
      стихах[18].
    </p>
    <p>
      В лицейский период Пушкин написал много стихотворных произведений. Его вдохновляли французские поэты XVII—XVIII
      веков, с творчеством которых он познакомился в детстве, читая книги из библиотеки отца. Любимые поэты и писатели
      молодого Пушкина перечислены в стихотворении «Городок» (1815 г.): Вольтер, Гомер, Вергилий, Т. Тассо, Лафонтен,
      Дмитриев, Крылов, Державин, Вержье, Грекур, Парни, Расин, Мольер, Фонвизин, Княжнин, Озеров, Руссо, Карамзин,
      Лагарп[19]. В его ранней лирике соединились традиции французского и русского классицизма. Учителями
      Пушкина-поэта стали Батюшков, признанный мастер «лёгкой поэзии», и Жуковский, глава отечественного романтизма.
      Пушкинская лирика периода 1813—1815 годов пронизана мотивами быстротечности жизни, которая диктовала жажду
      наслаждения радостями бытия. С 1816 года, вслед за Жуковским, он обращается к элегиям, где развивает характерные
      для этого жанра мотивы: неразделённой любви, ухода молодости, угасания души. Лирика Пушкина ещё подражательна,
      полна литературных условностей и штампов, тем не менее уже тогда начинающий поэт выбирает свой, особый путь[20].
      Не замыкаясь на поэзии камерной, Пушкин обращался к темам более сложным, общественно значимым. «Воспоминания в
      Царском Селе» (1814), заслужившие одобрение Державина, — в начале 1815 года Пушкин читал стихотворение в его
      присутствии, — посвящено событиям Отечественной войны 1812 года[21]. Стихотворение было опубликовано в 1815 году
      в журнале «Российский музеум» за полной подписью автора. А в пушкинском послании «Лицинию» критически изображена
      современная жизнь России, где в образе «любимца деспота» выведен Аракчеев. Уже в начале своего творческого пути
      Пушкин проявлял интерес к русским писателям-сатирикам прошлого века. Влияние Фонвизина чувствуется в
      сатирической поэме Пушкина «Тень Фонвизина» (1815)[22]; с творчеством Радищева связаны «Бова» (1814) и
      «Безверие» (1817)[23].
    </p>
    <p>
      В июле 1814 года Пушкин впервые выступил в печати в издававшемся в Москве журнале «Вестник Европы». В
      тринадцатом номере было напечатано стихотворение «К другу-стихотворцу», подписанное псевдонимом Александр
      Н.к.ш.п. и обращённое к Кюхельбекеру[~ 5][13]:60[24].
    </p>
    <p>
      Ещё воспитанником Лицея, Пушкин вошёл в литературное общество «Арзамас»[25], выступавшее против рутины и архаики
      в литературном деле, и принял действенное участие в полемике с объединением «Беседа любителей русского слова»,
      отстаивавшим каноны классицизма прошлого века. Привлечённый творчеством наиболее ярких представителей нового
      литературного направления, Пушкин испытывал в то время сильное влияние поэзии Батюшкова, Жуковского,
      Давыдова[26]. Последний поначалу импонировал Пушкину темой бравого вояки, а после тем, что сам поэт называл
      «кручением стиха» — резкими сменами настроения, экспрессией, неожиданным соединением образов. Позднее Пушкин
      говорил, что подражая в молодости Давыдову, «усвоил себе его манеру навсегда»[27]. Многие лицейские
      стихотворения Пушкина навеяны лирикой Дениса Давыдова: «Пирующие студенты», «Казак», «Наездники», «Усы»,
      «Воспоминание».
    </p>
  </div>
</template>

<style>
.demo-main {
  padding: 32px 16px;
}
</style>
